; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	p1-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s1)
	(at package2 s2)
	(at package3 s1)
	(at package4 s2)
	(at package5 s0)
	(at package6 s1)
	(at package7 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 80)
	(= (time-to-drive s1 s0) 80)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 78)
	(= (time-to-drive s2 s0) 78)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 58)
	(= (time-to-drive s2 s1) 58)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s2)
	(at truck1 s0)
	(at truck2 s2)
	(at truck3 s1)
	(at package1 s1)
	(at package2 s0)
	(at package3 s0)
	(at package4 s2)
	(at package5 s1)
	(at package6 s0)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 5 of 12
2. (load-truck package6 truck3 s1)
   deleted: (at package6 s1)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 12
3. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 0 to 880
   goals met: 4 of 12
4. (unload-truck package6 truck3 s0)
   deleted: (in package6 truck3)
   added: (at package6 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 5 of 12
5. (load-truck package5 truck3 s0)
   deleted: (at package5 s0)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 12
6. (drive-truck truck3 s0 s1 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 880 to 1760
   goals met: 6 of 12
7. (unload-truck package5 truck3 s1)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 12
8. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 12
9. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 12
10. (load-truck package3 truck3 s1)
   deleted: (at package3 s1)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 12
11. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 1760 to 2618
   goals met: 7 of 12
12. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 8 of 12
13. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 8 of 12
14. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   goals met: 8 of 12
15. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 2618 to 3498
   goals met: 7 of 12
16. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   goals met: 8 of 12
17. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 8 of 12
18. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   goals met: 8 of 12
19. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   goals met: 9 of 12
20. (walk driver2 s1 p1-0)
   deleted: (at driver2 s1)
   added: (at driver2 p1-0)
   goals met: 8 of 12
21. (unload-truck package3 truck3 s0)
   deleted: (in package3 truck3)
   added: (at package3 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 12
22. (walk driver2 p1-0 s0)
   deleted: (at driver2 p1-0)
   added: (at driver2 s0)
   goals met: 9 of 12
23. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 12
24. (drive-truck truck3 s0 s1 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 3498 to 4298
   goals met: 10 of 12
25. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 11 of 12
26. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 10 of 12
27. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 10 of 12
28. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 12
29. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 4298 to 5078
   goals met: 11 of 12
30. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 12 of 12
